       01  CFT001.
           05  BLANK SCREEN.
           05  LINE 01  COLUMN 01
               VALUE  "ษอออออออออออออออออออออออออออออออออออออออ".
           05  LINE 01  COLUMN 41
               VALUE  "อออออออออออออออออออออออออออออออออออออออป".
           05  LINE 02  COLUMN 01
               VALUE  "บ                        *** CADASTRO DE".
           05  LINE 02  COLUMN 41
               VALUE  " AMIGOS ***                            บ".
           05  LINE 03  COLUMN 01
               VALUE  "ฬอออออออออออออออออออออออออออออออออออออออ".
           05  LINE 03  COLUMN 41
               VALUE  "อออออออออออออออออออออออออออออออออออออออน".
           05  LINE 04  COLUMN 01
               VALUE  "บ".
           05  LINE 04  COLUMN 41
               VALUE  "                                       บ".
           05  LINE 05  COLUMN 01
               VALUE  "บ".
           05  LINE 05  COLUMN 41
               VALUE  "                                       บ".
           05  LINE 06  COLUMN 01
               VALUE  "บ ฺAPELIDOฤฤฤฤฤฤฤฟ ฺNOMEฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤ".
           05  LINE 06  COLUMN 41
               VALUE  "ฤฤฤฤฤฤฤฤฤฤฤฤฟ   ฺIDADEฤฟ               บ".
           05  LINE 07  COLUMN 01
               VALUE  "บ ณ              ณ ณ".
           05  LINE 07  COLUMN 41
               VALUE  "            ณ   ณ      ณ               บ".
           05  LINE 08  COLUMN 01
               VALUE  "บ ภฤฤฤฤฤฤฤฤฤฤฤฤฤฤู ภฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤ".
           05  LINE 08  COLUMN 41
               VALUE  "ฤฤฤฤฤฤฤฤฤฤฤฤู   ภฤฤฤฤฤฤู               บ".
           05  LINE 09  COLUMN 01
               VALUE  "บ ฺENDERECOฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ ฺBA".
           05  LINE 09  COLUMN 41
               VALUE  "IRROฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ                  บ".
           05  LINE 10  COLUMN 01
               VALUE  "บ ณ                                ณ ณ".
           05  LINE 10  COLUMN 41
               VALUE  "                    ณ                  บ".
           05  LINE 11  COLUMN 01
               VALUE  "บ ภฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤู ภฤฤ".
           05  LINE 11  COLUMN 41
               VALUE  "ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤู                  บ".
           05  LINE 12  COLUMN 01
               VALUE  "บ ฺCIDADEฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ ฺUFฤฤฟ ฺTELE".
           05  LINE 12  COLUMN 41
               VALUE  "FONEฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ ฺCEPฤฤฤฤฤฤฤฤฟ      บ".
           05  LINE 13  COLUMN 01
               VALUE  "บ ณ                       ณ ณ    ณ ณ".
           05  LINE 13  COLUMN 41
               VALUE  "                  ณ ณ           ณ      บ".
           05  LINE 14  COLUMN 01
               VALUE  "บ ภฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤู ภฤฤฤฤู ภฤฤฤฤ".
           05  LINE 14  COLUMN 41
               VALUE  "ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤู ภฤฤฤฤฤฤฤฤฤฤฤู      บ".
           05  LINE 15  COLUMN 01
               VALUE  "บ ฺEMAILฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ".
           05  LINE 15  COLUMN 41
               VALUE  "                                       บ".
           05  LINE 16  COLUMN 01
               VALUE  "บ ณ                                ณ".
           05  LINE 16  COLUMN 41
               VALUE  "                                       บ".
           05  LINE 17  COLUMN 01
               VALUE  "บ ภฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤู".
           05  LINE 17  COLUMN 41
               VALUE  "                                       บ".
           05  LINE 18  COLUMN 01
               VALUE  "บ".
           05  LINE 18  COLUMN 41
               VALUE  "                                       บ".
           05  LINE 19  COLUMN 01
               VALUE  "บ".
           05  LINE 19  COLUMN 41
               VALUE  "                                       บ".
           05  LINE 20  COLUMN 01
               VALUE  "บ".
           05  LINE 20  COLUMN 41
               VALUE  "                                       บ".
           05  LINE 21  COLUMN 01
               VALUE  "บ".
           05  LINE 21  COLUMN 41
               VALUE  "                                       บ".
           05  LINE 22  COLUMN 01
               VALUE  "ฬอออออออออออออออออออออออออออออออออออออออ".
           05  LINE 22  COLUMN 41
               VALUE  "ออออออออออออออออออออออออออออออหออออออออน".
           05  LINE 23  COLUMN 01
               VALUE  "บMENSAGEM :".
           05  LINE 23  COLUMN 41
               VALUE  "                              บ CFP001 บ".
           05  LINE 24  COLUMN 01
               VALUE  "ศอออออออออออออออออออออออออออออออออออออออ".
           05  LINE 24  COLUMN 41
               VALUE  "ออออออออออออออออออออออออออออออสออออออออผ".
           05  T-APELIDO
               LINE 07  COLUMN 05  PIC X(12)
               USING  V-APELIDO
               HIGHLIGHT.
           05  T-NOME
               LINE 07  COLUMN 22  PIC X(30)
               USING  V-NOME
               HIGHLIGHT.
           05  T-IDADE
               LINE 07  COLUMN 60  PIC 9(02)
               USING  V-IDADE
               HIGHLIGHT.
           05  T-ENDERECO
               LINE 10  COLUMN 05  PIC X(30)
               USING  V-ENDERECO
               HIGHLIGHT.
           05  T-BAIRRO
               LINE 10  COLUMN 40  PIC
               USING  V-BAIRRO
               HIGHLIGHT.
           05  T-CIDADE
               LINE 13  COLUMN 05  PIC X(21)
               USING  V-CIDADE
               HIGHLIGHT.
           05  T-ESTADO
               LINE 13  COLUMN 31  PIC X(02)
               USING  V-ESTADO
               HIGHLIGHT.
           05  T-FONE
               LINE 13  COLUMN 38  PIC X(20)
               USING  V-FONE
               HIGHLIGHT.
           05  T-CEP
               LINE 13  COLUMN 63  PIC 99999.999
               USING  V-CEP
               HIGHLIGHT.
           05  T-EMAIL
               LINE 16  COLUMN 05  PIC X(30)
               USING  V-EMAIL
               HIGHLIGHT.